/*
　どうでもいいシャリタツ語(自作)変換よう。
　使用可能文字　：　オ、レ、モ、ヌ、シ、ャ、リ、ス、メ、ー、ッ
　　　　　　　　　　{濁点(゛)、半濁点(゜)もok、大文字化、小文字化もok}
https://www.youtube.com/watch?v=VZoxLB8tnu0
*/
var syaritatsu_moji = {
  あ:"ヤ",
  い:"リ",
  う:"ス",
  え:"メ",
  お:"オ",
  か:"ヤ",
  が:"ヤ",
  き:"リ",
  ぎ:"リ\"",
  きゅ:"ス",
  ぎゅ:"ズ",
  きょ:"リォ",
  ぎょ:"リ\"ォ",
  く:"ス",
  ぐ:"ズ",
  け:"レ",
  げ:"レ\"",
  こ:"モ",
  ご:"モ\"",
  さ:"シャ",
  ざ:"ヤ\"",
  し:"シ",
  じ:"シ\"",
  しゅ:"ス",
  じゅ:"ジ",
  しょ:"シォ",
  じょ:"ジォ",
  す:"ス",
  ず:"ス\"",
  せ:"メ",
  ぜ:"メ\"",
  そ:"モ",
  ぞ:"モ\"",
  た:"ヤ",
  だ:"ヤ\"",
  ち:"シ",
  ぢ:"ジ",
  ちゅ:"ツ",
  ちょ:"ツォ",
  つ:"ツ",
  づ:"ヅ",
  っ:"ッ",
  て:"メ",
  で:"レ\"",
  と:"モ",
  ど:"モ\"",
  な:"ヤ",
  に:"リ",
  にゅ:"ヌ",
  にょ:"リォ",
  ぬ:"ヌ",
  ね:"メ",
  の:"ヌォ",
  は:"ヤ",
  ば:"ヤ\"",
  ぱ:"ヤ",
  ひ:"シ",
  び:"ジ",
  ぴ:"リ",
  ひゅ:"ス",
  びゅ:"ズ",
  ぴゅ:"リッ",
  ひょ:"リォ",
  びょ:"リ\"ォ",
  ぴょ:"リ゜ォ",
  ぶ:"ヌ\"",
  ぷ:"ヌ",
  へ:"レ",
  べ:"メ",
  ほ:"オ",
  ぼ:"オ\"",
  ま:"ヤ",
  み:"シ",
  みゅ:"ス゜",
  みょ:"メォ",
  む:"ス゜",
  め:"メ",
  も:"モ",
  や:"ヤ",
  ゃ:"ャ",
  ゆ:"ヌ",
  よ:"モ",
  ら:"ヤ",
  り:"リ",
  りゅ:"リ゜",
  りょ:"リォ",
  る:"ヌ",
  れ:"レ",
  ろ:"モ",
  わ:"ヤ",
  を:"オ",
  ん:"ヌ",
  ー:"ー",
}
function to_syari(bun) {
  var a = [...bun];
  for(var i = 0; i < a.length; i++) {
    if(a[i+1] == "ゅ"||a[i+1] == "ょ") {
      a[i] += a[i+1];
      a.splice(i+1,1);
    }
  }
  for(var i = 0; i < a.length; i++) {
    var b = a[i];
    if(syaritatsu_moji[b]) {
      a[i] = syaritatsu_moji[b];
    }
  }
  console.log(a.join(''));
}
/*
シャーリー
♀
lv.52
現在経験値 : 133229
次のレベルまで : 8448
現在の技構成 :
  だくりゅう
  わるだくみ
  ミラーコート
  りゅうのはどう
思い出せる技 :
  おきみやげ
  ちょうはつ
  みずびたし
  みずのはどう
  てだすけ
  かたくなる
  みずでっぽう
  はねる
特性 : しれいとう
H 145
A 70
B 60
C 156
D 118
S 90
テラスタイプ : 水
おっとり
ちょっぴり強情
ハイパーボールでつかまえた
  個体値
HP	24 ～ 25
攻撃	25 ～ 26
防御	0 ～ 1
特攻	24 ～ 25
特防	29
素早	0 ～ 1
*/